{"tok2id": {"36.48_16": 0, "36_8": 1, "40_4": 2, "41_2": 3, "41_8": 4, "42_2": 5, "42_8": 6, "43_2": 7, "43_4": 8, "43_8": 9, "44_4": 10, "44_8": 11, "45_12": 12, "45_2": 13, "45_4": 14, "45_8": 15, "47_15": 16, "47_2": 17, "47_4": 18, "47_8": 19, "48_15": 20, "48_2": 21, "48_4": 22, "48_7": 23, "48_8": 24, "49_4": 25, "50_1": 26, "50_2": 27, "50_4": 28, "50_7": 29, "50_8": 30, "51_7": 31, "52_2": 32, "52_4": 33, "52_7": 34, "52_8": 35, "53_1": 36, "53_2": 37, "53_3": 38, "53_4": 39, "53_7": 40, "53_8": 41, "54_2": 42, "54_4": 43, "55_1": 44, "55_2": 45, "55_4": 46, "55_6": 47, "55_7": 48, "55_8": 49, "56_2": 50, "56_4": 51, "56_7": 52, "57_1": 53, "57_2": 54, "57_4": 55, "57_6": 56, "57_7": 57, "57_8": 58, "58_1": 59, "58_2": 60, "58_7": 61, "59_1": 62, "59_2": 63, "59_4": 64, "59_6": 65, "59_7": 66, "59_8": 67, "60.64.67_12": 68, "60.64.67_16": 69, "60.64.67_4": 70, "60.64.67_8": 71, "60_1": 72, "60_2": 73, "60_4": 74, "60_7": 75, "60_8": 76, "61_2": 77, "61_4": 78, "62.59_1": 79, "62.64.67.70_4": 80, "62.65.67.71_4": 81, "62.65.69.72_8": 82, "62.65.69_2": 83, "62.65.69_4": 84, "62.65.69_8": 85, "62.65.70_2": 86, "62.65.71_4": 87, "62.66.69_16": 88, "62.66.69_2": 89, "62.66.69_4": 90, "62.66.69_8": 91, "62_1": 92, "62_2": 93, "62_4": 94, "62_6": 95, "62_7": 96, "62_8": 97, "63_1": 98, "64.67.69.73_4": 99, "64.67.70.73_4": 100, "64.67.71_2": 101, "64.67.71_4": 102, "64.67.71_8": 103, "64.67.72_16": 104, "64.67.72_4": 105, "64.67.72_8": 106, "64.67.73_2": 107, "64.67.73_4": 108, "64.67.73_8": 109, "64.68.71_12": 110, "64.68.71_4": 111, "64.68.71_8": 112, "64_1": 113, "64_12": 114, "64_2": 115, "64_4": 116, "64_7": 117, "64_8": 118, "65.67.71.74_2": 119, "65.67.71.74_4": 120, "65.68.72_4": 121, "65.68.72_6": 122, "65.68.72_8": 123, "65.69.71.74_4": 124, "65.69.72.74_4": 125, "65.69.72_12": 126, "65.69.72_2": 127, "65.69.72_4": 128, "65.69.72_8": 129, "65.69.74_2": 130, "65.69.74_4": 131, "65_1": 132, "65_2": 133, "65_4": 134, "66.69.71.75_2": 135, "66.69.73_4": 136, "66.69.73_8": 137, "66.69.74_4": 138, "66.69.75_2": 139, "66.69.75_4": 140, "66_1": 141, "66_2": 142, "66_4": 143, "67.69.73.76_2": 144, "67.70.73.76_4": 145, "67.70.73.77_2": 146, "67.70.74.76_2": 147, "67.70.74.76_4": 148, "67.70.74.77_2": 149, "67.70.74_2": 150, "67.70.74_4": 151, "67.70.74_8": 152, "67.70.76_2": 153, "67.70.76_4": 154, "67.71.74.76_2": 155, "67.71.74.76_4": 156, "67.71.74.77_2": 157, "67.71.74.77_4": 158, "67.71.74_12": 159, "67.71.74_2": 160, "67.71.74_4": 161, "67.71.74_6": 162, "67.71.74_8": 163, "67.71.76_2": 164, "67.71.76_4": 165, "67.72.76_4": 166, "67_1": 167, "67_2": 168, "67_3": 169, "67_4": 170, "67_6": 171, "68.71.76_4": 172, "68.71.77_8": 173, "68.72.75_4": 174, "68.72.75_8": 175, "68.72.77_4": 176, "68_1": 177, "68_2": 178, "68_4": 179, "69.71.74.77_2": 180, "69.71.74.78_4": 181, "69.71.75.78_2": 182, "69.72.74.78_2": 183, "69.72.75.78_2": 184, "69.72.76.79_2": 185, "69.72.76.79_4": 186, "69.72.76_12": 187, "69.72.76_2": 188, "69.72.76_4": 189, "69.72.76_8": 190, "69.72.77_4": 191, "69.72.77_8": 192, "69.72.78_2": 193, "69.72.78_4": 194, "69.73.76.77_2": 195, "69.73.76.78_4": 196, "69.73.76.79_1": 197, "69.73.76.79_2": 198, "69.73.76.79_4": 199, "69.73.76_1": 200, "69.73.76_12": 201, "69.73.76_2": 202, "69.73.76_4": 203, "69.73.76_8": 204, "69.74.77_4": 205, "69.74.78_2": 206, "69_1": 207, "69_12": 208, "69_2": 209, "69_4": 210, "69_6": 211, "69_8": 212, "70.72.76.79_4": 213, "70.73.77.79_4": 214, "70.73.77_2": 215, "70.73.77_8": 216, "70.73.79_2": 217, "70.73.79_4": 218, "70.74.76.79_2": 219, "70.74.76.79_4": 220, "70.74.77.79_2": 221, "70.74.77.79_4": 222, "70.74.77_4": 223, "70.74.77_8": 224, "70.74.79_2": 225, "70.74.79_4": 226, "71.74.76.80_2": 227, "71.74.76.80_4": 228, "71.74.77.79_2": 229, "71.74.77.79_4": 230, "71.74.77.80_4": 231, "71.74.77.81_4": 232, "71.74.78.80_4": 233, "71.74.78_1": 234, "71.74.78_12": 235, "71.74.78_2": 236, "71.74.78_4": 237, "71.74.78_8": 238, "71.74.79_2": 239, "71.74.79_4": 240, "71.74.79_6": 241, "71.74.79_8": 242, "71.74.80_1": 243, "71.74.80_2": 244, "71.74.80_4": 245, "71.75.78.81_2": 246, "71.75.78.81_4": 247, "71.75.78.81_8": 248, "71.75.78_1": 249, "71.75.78_2": 250, "71.75.78_4": 251, "71.75.78_8": 252, "71.76.79_4": 253, "71.76.80_4": 254, "71_1": 255, "71_2": 256, "71_4": 257, "72.71_1": 258, "72.74.78.81_2": 259, "72.74.78.81_4": 260, "72.75.78.81_2": 261, "72.75.79_4": 262, "72.75.79_8": 263, "72.75.80_4": 264, "72.75.81_4": 265, "72.76.79.81_4": 266, "72.76.79.82_1": 267, "72.76.79.82_2": 268, "72.76.79.82_4": 269, "72.76.79.83_2": 270, "72.76.79.83_4": 271, "72.76.79_2": 272, "72.76.79_3": 273, "72.76.79_4": 274, "72.76.79_6": 275, "72.76.79_8": 276, "72.76.81_2": 277, "72.76.81_4": 278, "72.76.81_8": 279, "72.77.80_4": 280, "72.77.81_4": 281, "72_1": 282, "72_2": 283, "72_3": 284, "72_4": 285, "72_8": 286, "73.75.79.82_2": 287, "73.76.79.81_2": 288, "73.76.79.81_4": 289, "73.76.79.81_6": 290, "73.76.79.82_2": 291, "73.76.79.82_4": 292, "73.76.79.83_2": 293, "73.76.79.83_4": 294, "73.76.79.83_8": 295, "73.76.79_2": 296, "73.76.80_2": 297, "73.76.80_4": 298, "73.76.81_2": 299, "73.76.81_4": 300, "73.76.82_2": 301, "73.76.82_4": 302, "73.77.80.82_4": 303, "73.77.80.83_4": 304, "73.77.80_4": 305, "73.77.80_8": 306, "73.77.82_4": 307, "73.79.82_2": 308, "73_1": 309, "73_2": 310, "73_4": 311, "74.76.79.83_2": 312, "74.76.80.83_2": 313, "74.76.80.83_4": 314, "74.76.80.83_8": 315, "74.77.81.83_2": 316, "74.77.81.83_4": 317, "74.77.81.84_4": 318, "74.77.81_2": 319, "74.77.81_4": 320, "74.77.82_4": 321, "74.77.83_4": 322, "74.78.81.83_2": 323, "74.78.81.83_4": 324, "74.78.81.84_2": 325, "74.78.81.84_4": 326, "74.78.81.85_2": 327, "74.78.81.85_4": 328, "74.78.81_2": 329, "74.78.81_4": 330, "74.78.81_6": 331, "74.78.81_8": 332, "74.78.83_2": 333, "74.78.83_4": 334, "74.79.83_4": 335, "74.80.83_2": 336, "74.85.85_4": 337, "74_1": 338, "74_2": 339, "74_3": 340, "74_4": 341, "74_6": 342, "75.77.81.84_2": 343, "75.77.81.84_4": 344, "75.78.81.83_2": 345, "75.78.81.83_4": 346, "75.78.81.84_4": 347, "75.78.81.84_6": 348, "75.78.81.85_4": 349, "75.78.82.84_4": 350, "75.78.83_2": 351, "75.78.83_3": 352, "75.78.83_4": 353, "75.79.82.85_2": 354, "75.79.82_2": 355, "75.79.82_6": 356, "75.79.82_8": 357, "75.79.84_4": 358, "75.79.85_4": 359, "76.74_1": 360, "76.78.81.84_2": 361, "76.78.82.85_2": 362, "76.79.82.86_2": 363, "76.79.83.84_2": 364, "76.79.83.85_4": 365, "76.79.83.86_4": 366, "76.79.83_2": 367, "76.79.83_4": 368, "76.79.84_2": 369, "76.79.84_4": 370, "76.79.85_4": 371, "76.80.83.86_1": 372, "76.80.83.86_2": 373, "76.80.83.86_4": 374, "76.80.83_1": 375, "76.80.83_16": 376, "76.80.83_2": 377, "76.80.83_3": 378, "76.80.83_4": 379, "76.80.83_6": 380, "76.80.83_8": 381, "76.81.84_2": 382, "76.81.84_4": 383, "76.81.85_2": 384, "76.81.85_4": 385, "76_1": 386, "76_2": 387, "76_3": 388, "76_4": 389, "76_5": 390, "77.80.83.86_4": 391, "77.80.84_8": 392, "77.80.85_4": 393, "77.80.85_8": 394, "77.81.83.86_4": 395, "77.81.84.87_2": 396, "77.81.84_2": 397, "77.81.84_4": 398, "77.81.84_8": 399, "77.81.86_2": 400, "77.81.86_4": 401, "77_1": 402, "77_2": 403, "77_3": 404, "77_4": 405, "78.81.83.86_4": 406, "78.81.84.86_2": 407, "78.81.84.86_4": 408, "78.81.84.87_2": 409, "78.81.84.88_2": 410, "78.81.84_2": 411, "78.81.85_2": 412, "78.81.85_4": 413, "78.81.85_8": 414, "78.81.86_2": 415, "78.81.86_4": 416, "78.81.86_8": 417, "78.82.85.88_2": 418, "78.82.85.88_4": 419, "78.82.85_12": 420, "78.82.85_2": 421, "78.82.85_4": 422, "78.83.86_4": 423, "78_2": 424, "78_4": 425, "79.83.86_4": 426, "79.83.88_2": 427, "79.83.88_4": 428, "79_1": 429, "79_2": 430, "79_3": 431, "79_4": 432, "80.83.86.88_2": 433, "80.83.86.88_4": 434, "80.83.86.89_4": 435, "80.83.86.90_2": 436, "80.83.88_2": 437, "80.83.88_4": 438, "80.83.88_8": 439, "80_1": 440, "80_2": 441, "81.85.90_4": 442, "81_1": 443, "81_3": 444, "81_4": 445, "81_5": 446, "82.85.88.90_4": 447, "82.85.90_4": 448, "82_1": 449, "83_1": 450, "83_3": 451, "84_1": 452, "84_2": 453, "86_1": 454}, "id2tok": {"0": "36.48_16", "1": "36_8", "2": "40_4", "3": "41_2", "4": "41_8", "5": "42_2", "6": "42_8", "7": "43_2", "8": "43_4", "9": "43_8", "10": "44_4", "11": "44_8", "12": "45_12", "13": "45_2", "14": "45_4", "15": "45_8", "16": "47_15", "17": "47_2", "18": "47_4", "19": "47_8", "20": "48_15", "21": "48_2", "22": "48_4", "23": "48_7", "24": "48_8", "25": "49_4", "26": "50_1", "27": "50_2", "28": "50_4", "29": "50_7", "30": "50_8", "31": "51_7", "32": "52_2", "33": "52_4", "34": "52_7", "35": "52_8", "36": "53_1", "37": "53_2", "38": "53_3", "39": "53_4", "40": "53_7", "41": "53_8", "42": "54_2", "43": "54_4", "44": "55_1", "45": "55_2", "46": "55_4", "47": "55_6", "48": "55_7", "49": "55_8", "50": "56_2", "51": "56_4", "52": "56_7", "53": "57_1", "54": "57_2", "55": "57_4", "56": "57_6", "57": "57_7", "58": "57_8", "59": "58_1", "60": "58_2", "61": "58_7", "62": "59_1", "63": "59_2", "64": "59_4", "65": "59_6", "66": "59_7", "67": "59_8", "68": "60.64.67_12", "69": "60.64.67_16", "70": "60.64.67_4", "71": "60.64.67_8", "72": "60_1", "73": "60_2", "74": "60_4", "75": "60_7", "76": "60_8", "77": "61_2", "78": "61_4", "79": "62.59_1", "80": "62.64.67.70_4", "81": "62.65.67.71_4", "82": "62.65.69.72_8", "83": "62.65.69_2", "84": "62.65.69_4", "85": "62.65.69_8", "86": "62.65.70_2", "87": "62.65.71_4", "88": "62.66.69_16", "89": "62.66.69_2", "90": "62.66.69_4", "91": "62.66.69_8", "92": "62_1", "93": "62_2", "94": "62_4", "95": "62_6", "96": "62_7", "97": "62_8", "98": "63_1", "99": "64.67.69.73_4", "100": "64.67.70.73_4", "101": "64.67.71_2", "102": "64.67.71_4", "103": "64.67.71_8", "104": "64.67.72_16", "105": "64.67.72_4", "106": "64.67.72_8", "107": "64.67.73_2", "108": "64.67.73_4", "109": "64.67.73_8", "110": "64.68.71_12", "111": "64.68.71_4", "112": "64.68.71_8", "113": "64_1", "114": "64_12", "115": "64_2", "116": "64_4", "117": "64_7", "118": "64_8", "119": "65.67.71.74_2", "120": "65.67.71.74_4", "121": "65.68.72_4", "122": "65.68.72_6", "123": "65.68.72_8", "124": "65.69.71.74_4", "125": "65.69.72.74_4", "126": "65.69.72_12", "127": "65.69.72_2", "128": "65.69.72_4", "129": "65.69.72_8", "130": "65.69.74_2", "131": "65.69.74_4", "132": "65_1", "133": "65_2", "134": "65_4", "135": "66.69.71.75_2", "136": "66.69.73_4", "137": "66.69.73_8", "138": "66.69.74_4", "139": "66.69.75_2", "140": "66.69.75_4", "141": "66_1", "142": "66_2", "143": "66_4", "144": "67.69.73.76_2", "145": "67.70.73.76_4", "146": "67.70.73.77_2", "147": "67.70.74.76_2", "148": "67.70.74.76_4", "149": "67.70.74.77_2", "150": "67.70.74_2", "151": "67.70.74_4", "152": "67.70.74_8", "153": "67.70.76_2", "154": "67.70.76_4", "155": "67.71.74.76_2", "156": "67.71.74.76_4", "157": "67.71.74.77_2", "158": "67.71.74.77_4", "159": "67.71.74_12", "160": "67.71.74_2", "161": "67.71.74_4", "162": "67.71.74_6", "163": "67.71.74_8", "164": "67.71.76_2", "165": "67.71.76_4", "166": "67.72.76_4", "167": "67_1", "168": "67_2", "169": "67_3", "170": "67_4", "171": "67_6", "172": "68.71.76_4", "173": "68.71.77_8", "174": "68.72.75_4", "175": "68.72.75_8", "176": "68.72.77_4", "177": "68_1", "178": "68_2", "179": "68_4", "180": "69.71.74.77_2", "181": "69.71.74.78_4", "182": "69.71.75.78_2", "183": "69.72.74.78_2", "184": "69.72.75.78_2", "185": "69.72.76.79_2", "186": "69.72.76.79_4", "187": "69.72.76_12", "188": "69.72.76_2", "189": "69.72.76_4", "190": "69.72.76_8", "191": "69.72.77_4", "192": "69.72.77_8", "193": "69.72.78_2", "194": "69.72.78_4", "195": "69.73.76.77_2", "196": "69.73.76.78_4", "197": "69.73.76.79_1", "198": "69.73.76.79_2", "199": "69.73.76.79_4", "200": "69.73.76_1", "201": "69.73.76_12", "202": "69.73.76_2", "203": "69.73.76_4", "204": "69.73.76_8", "205": "69.74.77_4", "206": "69.74.78_2", "207": "69_1", "208": "69_12", "209": "69_2", "210": "69_4", "211": "69_6", "212": "69_8", "213": "70.72.76.79_4", "214": "70.73.77.79_4", "215": "70.73.77_2", "216": "70.73.77_8", "217": "70.73.79_2", "218": "70.73.79_4", "219": "70.74.76.79_2", "220": "70.74.76.79_4", "221": "70.74.77.79_2", "222": "70.74.77.79_4", "223": "70.74.77_4", "224": "70.74.77_8", "225": "70.74.79_2", "226": "70.74.79_4", "227": "71.74.76.80_2", "228": "71.74.76.80_4", "229": "71.74.77.79_2", "230": "71.74.77.79_4", "231": "71.74.77.80_4", "232": "71.74.77.81_4", "233": "71.74.78.80_4", "234": "71.74.78_1", "235": "71.74.78_12", "236": "71.74.78_2", "237": "71.74.78_4", "238": "71.74.78_8", "239": "71.74.79_2", "240": "71.74.79_4", "241": "71.74.79_6", "242": "71.74.79_8", "243": "71.74.80_1", "244": "71.74.80_2", "245": "71.74.80_4", "246": "71.75.78.81_2", "247": "71.75.78.81_4", "248": "71.75.78.81_8", "249": "71.75.78_1", "250": "71.75.78_2", "251": "71.75.78_4", "252": "71.75.78_8", "253": "71.76.79_4", "254": "71.76.80_4", "255": "71_1", "256": "71_2", "257": "71_4", "258": "72.71_1", "259": "72.74.78.81_2", "260": "72.74.78.81_4", "261": "72.75.78.81_2", "262": "72.75.79_4", "263": "72.75.79_8", "264": "72.75.80_4", "265": "72.75.81_4", "266": "72.76.79.81_4", "267": "72.76.79.82_1", "268": "72.76.79.82_2", "269": "72.76.79.82_4", "270": "72.76.79.83_2", "271": "72.76.79.83_4", "272": "72.76.79_2", "273": "72.76.79_3", "274": "72.76.79_4", "275": "72.76.79_6", "276": "72.76.79_8", "277": "72.76.81_2", "278": "72.76.81_4", "279": "72.76.81_8", "280": "72.77.80_4", "281": "72.77.81_4", "282": "72_1", "283": "72_2", "284": "72_3", "285": "72_4", "286": "72_8", "287": "73.75.79.82_2", "288": "73.76.79.81_2", "289": "73.76.79.81_4", "290": "73.76.79.81_6", "291": "73.76.79.82_2", "292": "73.76.79.82_4", "293": "73.76.79.83_2", "294": "73.76.79.83_4", "295": "73.76.79.83_8", "296": "73.76.79_2", "297": "73.76.80_2", "298": "73.76.80_4", "299": "73.76.81_2", "300": "73.76.81_4", "301": "73.76.82_2", "302": "73.76.82_4", "303": "73.77.80.82_4", "304": "73.77.80.83_4", "305": "73.77.80_4", "306": "73.77.80_8", "307": "73.77.82_4", "308": "73.79.82_2", "309": "73_1", "310": "73_2", "311": "73_4", "312": "74.76.79.83_2", "313": "74.76.80.83_2", "314": "74.76.80.83_4", "315": "74.76.80.83_8", "316": "74.77.81.83_2", "317": "74.77.81.83_4", "318": "74.77.81.84_4", "319": "74.77.81_2", "320": "74.77.81_4", "321": "74.77.82_4", "322": "74.77.83_4", "323": "74.78.81.83_2", "324": "74.78.81.83_4", "325": "74.78.81.84_2", "326": "74.78.81.84_4", "327": "74.78.81.85_2", "328": "74.78.81.85_4", "329": "74.78.81_2", "330": "74.78.81_4", "331": "74.78.81_6", "332": "74.78.81_8", "333": "74.78.83_2", "334": "74.78.83_4", "335": "74.79.83_4", "336": "74.80.83_2", "337": "74.85.85_4", "338": "74_1", "339": "74_2", "340": "74_3", "341": "74_4", "342": "74_6", "343": "75.77.81.84_2", "344": "75.77.81.84_4", "345": "75.78.81.83_2", "346": "75.78.81.83_4", "347": "75.78.81.84_4", "348": "75.78.81.84_6", "349": "75.78.81.85_4", "350": "75.78.82.84_4", "351": "75.78.83_2", "352": "75.78.83_3", "353": "75.78.83_4", "354": "75.79.82.85_2", "355": "75.79.82_2", "356": "75.79.82_6", "357": "75.79.82_8", "358": "75.79.84_4", "359": "75.79.85_4", "360": "76.74_1", "361": "76.78.81.84_2", "362": "76.78.82.85_2", "363": "76.79.82.86_2", "364": "76.79.83.84_2", "365": "76.79.83.85_4", "366": "76.79.83.86_4", "367": "76.79.83_2", "368": "76.79.83_4", "369": "76.79.84_2", "370": "76.79.84_4", "371": "76.79.85_4", "372": "76.80.83.86_1", "373": "76.80.83.86_2", "374": "76.80.83.86_4", "375": "76.80.83_1", "376": "76.80.83_16", "377": "76.80.83_2", "378": "76.80.83_3", "379": "76.80.83_4", "380": "76.80.83_6", "381": "76.80.83_8", "382": "76.81.84_2", "383": "76.81.84_4", "384": "76.81.85_2", "385": "76.81.85_4", "386": "76_1", "387": "76_2", "388": "76_3", "389": "76_4", "390": "76_5", "391": "77.80.83.86_4", "392": "77.80.84_8", "393": "77.80.85_4", "394": "77.80.85_8", "395": "77.81.83.86_4", "396": "77.81.84.87_2", "397": "77.81.84_2", "398": "77.81.84_4", "399": "77.81.84_8", "400": "77.81.86_2", "401": "77.81.86_4", "402": "77_1", "403": "77_2", "404": "77_3", "405": "77_4", "406": "78.81.83.86_4", "407": "78.81.84.86_2", "408": "78.81.84.86_4", "409": "78.81.84.87_2", "410": "78.81.84.88_2", "411": "78.81.84_2", "412": "78.81.85_2", "413": "78.81.85_4", "414": "78.81.85_8", "415": "78.81.86_2", "416": "78.81.86_4", "417": "78.81.86_8", "418": "78.82.85.88_2", "419": "78.82.85.88_4", "420": "78.82.85_12", "421": "78.82.85_2", "422": "78.82.85_4", "423": "78.83.86_4", "424": "78_2", "425": "78_4", "426": "79.83.86_4", "427": "79.83.88_2", "428": "79.83.88_4", "429": "79_1", "430": "79_2", "431": "79_3", "432": "79_4", "433": "80.83.86.88_2", "434": "80.83.86.88_4", "435": "80.83.86.89_4", "436": "80.83.86.90_2", "437": "80.83.88_2", "438": "80.83.88_4", "439": "80.83.88_8", "440": "80_1", "441": "80_2", "442": "81.85.90_4", "443": "81_1", "444": "81_3", "445": "81_4", "446": "81_5", "447": "82.85.88.90_4", "448": "82.85.90_4", "449": "82_1", "450": "83_1", "451": "83_3", "452": "84_1", "453": "84_2", "454": "86_1"}}